Andydingbing/SPC5/rd/chip/reg_def_sp9500.h
#ifndef REG_DEF_SP9500_H
#define REG_DEF_SP9500_H

#include "reg_def.h"

#ifdef _DEBUG
#define K7_ASSERT() \
    if (m_k7 == nullptr) { \
        Log.set_last_err("device:k7 disconnect"); \
        return -1; \
    }

#define S6_ASSERT() \
    if (m_s6 == nullptr) { \
        Log.set_last_err("device:s6 disconnect"); \
        return -1; \
    }
#else
#define K7_ASSERT()
#define S6_ASSERT()
#endif

#define K7_W(ns,addr) \
    do {K7_ASSERT(); int32_t ret = 0; \
        if ((ret = m_k7->w32(pci_dev::AS_BAR0,uint16_t(addr<<2),REG_DATA(ns,addr)))) { \
            Log.set_last_err("%s:%s line%d",__FILE__,BOOST_CURRENT_FUNCTION,__LINE__); \
            return -1; \
        } \
        Log.add_reg(ret,m_k7->descriptor(),addr,REG_DATA(ns,addr)); \
    }while (0);

#define K7_W_2(ns,addr0,addr1) \
    do {K7_ASSERT(); int32_t ret = 0; \
        uint32_t addr = ns##r##addr0##addr1.addr[get_rf_idx()]; \
        if ((ret = m_k7->w32(pci_dev::AS_BAR0,addr<<2,REG_DATA_2(ns,addr0,addr1)))) { \
            Log.set_last_err("%s:%s line%d",__FILE__,BOOST_CURRENT_FUNCTION,__LINE__); \
            return -1; \
        } \
        Log.add_reg(ret,m_k7->descriptor(),addr,REG_DATA_2(ns,addr0,addr1)); \
    }while (0);

#define S6_W(ns,addr) \
    do {S6_ASSERT(); int32_t ret = 0; \
        if ((ret = m_s6->w32(pci_dev::AS_BAR0,uint16_t(addr <<2),REG_DATA(ns,addr)))) { \
            Log.set_last_err("%s:%s line%d",__FILE__,BOOST_CURRENT_FUNCTION,__LINE__); \
            return -1; \
        } \
        Log.add_reg(ret,m_s6->descriptor(),addr,REG_DATA(ns,addr)); \
    }while (0);

#define S6_W_2(ns,addr0,addr1) \
    do {S6_ASSERT(); \
        int32_t ret = 0; \
        uint32_t addr = ns##r##addr0##addr1.addr[get_rf_idx()/2]; \
        if ((ret = m_s6->w32(pci_dev::AS_BAR0,addr<<2,REG_DATA_2(ns,addr0,addr1)))) { \
            Log.set_last_err("%s:%s line%d",__FILE__,BOOST_CURRENT_FUNCTION,__LINE__); \
            return -1; \
        } \
        Log.add_reg(ret,m_s6->descriptor(),addr,REG_DATA_2(ns,addr0,addr1)); \
    }while (0);

#define K7_R(ns,addr) \
    do {K7_ASSERT(); int32_t ret = 0; \
        if ((ret = m_k7->r32(pci_dev::AS_BAR0,uint16_t(addr<<2),&REG_DATA(ns,addr)))) { \
            Log.set_last_err("%s:%s line%d",__FILE__,BOOST_CURRENT_FUNCTION,__LINE__); \
            return -1; \
        } \
        Log.add_reg(ret,m_k7->descriptor(),addr,0xffffffff,REG_DATA(ns,addr)); \
    }while (0);

#define K7_R_2(ns,addr0,addr1) \
    do {K7_ASSERT(); int32_t ret = 0; \
        uint32_t addr = ns##r##addr0##addr1.addr[get_rf_idx()]; \
        if ((ret = m_k7->r32(pci_dev::AS_BAR0,addr<<2,&REG_DATA_2(ns,addr0,addr1)))) { \
            Log.set_last_err("%s:%s line%d",__FILE__,BOOST_CURRENT_FUNCTION,__LINE__); \
            return -1; \
        } \
        Log.add_reg(ret,m_k7->descriptor(),addr,0xffffffff,REG_DATA_2(ns,addr0,addr1)); \
    }while (0);

#define S6_R(ns,addr) \
    do {S6_ASSERT(); int32_t ret = 0; \
        if ((ret = m_s6->r32(pci_dev::AS_BAR0,uint16_t(addr <<2),&REG_DATA(ns,addr)))) { \
            Log.set_last_err("%s:%s line%d",__FILE__,BOOST_CURRENT_FUNCTION,__LINE__); \
            return -1; \
        } \
        Log.add_reg(ret,m_s6->descriptor(),addr,0xffffffff,REG_DATA(ns,addr)); \
    }while (0);

#define S6_R_2(ns,addr0,addr1) \
    do {S6_ASSERT(); int32_t ret = 0; \
        uint32_t addr = ns##r##addr0##addr1.addr[get_rf_idx()/2]; \
        if ((ret = m_s6->r32(pci_dev::AS_BAR0,addr<<2,&REG_DATA_2(ns,addr0,addr1)))) { \
            Log.set_last_err("%s:%s line%d",__FILE__,BOOST_CURRENT_FUNCTION,__LINE__); \
            return -1; \
        } \
        Log.add_reg(ret,m_s6->descriptor(),addr,0xffffffff,REG_DATA_2(ns,addr0,addr1)); \
    }while (0);

#define K7OP(ns,addr,bit) \
    do {REG(ns,addr).bit = 0; \
        K7_W(ns,addr); \
        REG(ns,addr).bit = 1; \
        K7_W(ns,addr); \
        K7_W(ns,addr); \
        K7_W(ns,addr); \
        K7_W(ns,addr); \
        K7_W(ns,addr); \
        K7_W(ns,addr); \
        K7_W(ns,addr); \
        K7_W(ns,addr); \
        REG(ns,addr).bit = 0; \
        K7_W(ns,addr); \
    }while (0);
#define K7_OP(ns,addr) K7OP(ns,addr,op)

#define K7OP_2(ns,addr0,addr1,bit) \
    do {REG_2(ns,addr0,addr1).bit = 0; \
        K7_W_2(ns,addr0,addr1); \
        REG_2(ns,addr0,addr1).bit = 1; \
        K7_W_2(ns,addr0,addr1); \
        K7_W_2(ns,addr0,addr1); \
        K7_W_2(ns,addr0,addr1); \
        K7_W_2(ns,addr0,addr1); \
        K7_W_2(ns,addr0,addr1); \
        K7_W_2(ns,addr0,addr1); \
        K7_W_2(ns,addr0,addr1); \
        K7_W_2(ns,addr0,addr1); \
        REG_2(ns,addr0,addr1).bit = 0; \
        K7_W_2(ns,addr0,addr1); \
    } while (0);
#define K7_OP_2(ns,addr0,addr1) K7OP_2(ns,addr0,addr1,op)

#define K7OP_DELAY_2(ns,addr0,addr1,bit,time) \
    do {if (time) { sleep_ms(time); } \
        REG_2(ns,addr0,addr1).bit = 0; \
        K7_W_2(ns,addr0,addr1); \
        if (time) { sleep_ms(time); } \
        REG_2(ns,addr0,addr1).bit = 1; \
        K7_W_2(ns,addr0,addr1); \
        if (time) { sleep_ms(time); } \
        REG_2(ns,addr0,addr1).bit = 0; \
        K7_W_2(ns,addr0,addr1); \
    } while (0);
#define K7_OP_DELAY_2(ns,addr0,addr1,time) K7OP_DELAY_2(ns,addr0,addr1,op,time)

#define K7RE(ns,addr,bit) \
    do {REG(ns,addr).bit = 0; \
        K7_W(ns,addr); \
        REG(ns,addr).bit = 1; \
        K7_W(ns,addr); \
    }while (0);
#define K7_RE(ns,addr) K7RE(ns,addr,op)

#define K7FE(ns,addr,bit) \
    do {REG(ns,addr).bit = 1; \
        K7_W(ns,addr); \
        REG(ns,addr).bit = 0; \
        K7_W(ns,addr); \
    }while (0);
#define K7_FE(ns,addr) K7FE(ns,addr,op)

#define K7WAIT_IDLE(ns,addr,bit,flag,times) \
    do {bool idle = false; \
        K7_R(ns,addr); \
        for (int32_t i = 0;i < times;i ++) { \
            if (flag == REG(ns,addr).bit) { \
                idle = true; \
                break; \
            } \
            K7_R(ns,addr); \
        } \
        if (!idle) { \
            Log.set_last_err("reg%#06x wait idle timeout",addr); \
            return -1; \
        } \
    } while (0);
#define K7_WAIT_IDLE(ns,addr,flag,times)       K7WAIT_IDLE(ns,addr,busy, flag,times)
#define K7_WAIT_IDLE_BUSY2(ns,addr,flag,times) K7WAIT_IDLE(ns,addr,busy2,flag,times)

