Andydingbing/SPC5/rd/chip/reg_def_sp9500.h
#define K7WAIT_IDLE_2(ns,addr0,addr1,bit,flag,times) \
    do {bool idle = false; \
        uint32_t addr = ns##r##addr0##addr1.addr[get_rf_idx()]; \
        K7_R_2(ns,addr0,addr1); \
        for (int32_t i = 0;i < times;i ++) { \
            if (flag == REG_2(ns,addr0,addr1).bit) { \
                idle = true; \
                break; \
            } \
            K7_R_2(ns,addr0,addr1); \
        } \
        if (!idle) { \
            Log.set_last_err("reg%#06x wait idle timeout",addr); \
            return -1; \
        } \
    } while (0);
#define K7_WAIT_IDLE_2(ns,addr0,addr1,flag,times) K7WAIT_IDLE_2(ns,addr0,addr1,busy,flag,times)

#define S6OP(ns,addr,bit) \
    do {REG(ns,addr).bit = 0; \
        S6_W(ns,addr); \
        REG(ns,addr).bit = 1; \
        S6_W(ns,addr); \
        S6_W(ns,addr); \
        S6_W(ns,addr); \
        S6_W(ns,addr); \
        S6_W(ns,addr); \
        S6_W(ns,addr); \
        S6_W(ns,addr); \
        S6_W(ns,addr); \
        REG(ns,addr).bit = 0; \
        S6_W(ns,addr); \
    }while (0);
#define S6_OP(ns,addr) S6OP(ns,addr,op)

#define S6WAIT_FIFO_EMPTY_2(ns,addr0,addr1,bit,flag,times) \
    do {bool full = true; \
        uint32_t addr = ns##r##addr0##addr1.addr[get_rf_idx()/2]; \
        RFU_S6_R_2(addr0,addr1); \
        for (int32_t i = 0;i < times;i ++) { \
            if (flag != REG_2(ns,addr0,addr1).bit) { \
                full = false; \
                break; \
            } \
        } \
        if (full) { \
            Log.set_last_err("reg %#06x wait fifo empty timeout",addr); \
            return -1; \
        } \
    } while (0);
#define S6_WAIT_FIFO_EMPTY_2(ns,addr0,addr1,flag,times) S6WAIT_FIFO_EMPTY_2(ns,addr0,addr1,fifo_prog_full,flag,times)

#define RFU_K7_REG_DECLARE(addr) REG_DECL(ns_reg_rfu_k7,addr)
#define RFU_K7_REG(addr) REG(ns_reg_rfu_k7,addr)
#define RFU_K7_REG_DATA(addr) REG_DATA(ns_reg_rfu_k7,addr)
#define RFU_K7_REG_CLER(addr) REG_CLER(ns_reg_rfu_k7,addr)

#define RFU_K7OP(addr,bit) K7OP(ns_reg_rfu_k7,addr,bit)
#define RFU_K7_OP(addr) K7_OP(ns_reg_rfu_k7,addr)
#define RFU_K7_RE(addr) K7_RE(ns_reg_rfu_k7,addr)
#define RFU_K7_FE(addr) K7_FE(ns_reg_rfu_k7,addr)
#define RFU_K7_WAIT_IDLE(addr,flag,times) K7_WAIT_IDLE(ns_reg_rfu_k7,addr,flag,times)
#define RFU_K7_WAIT_IDLE_BUSY2(addr,flag,times) K7_WAIT_IDLE_BUSY2(ns_reg_rfu_k7,addr,flag,times)
#define RFU_K7_W(addr) K7_W(ns_reg_rfu_k7,addr)
#define RFU_K7_R(addr) K7_R(ns_reg_rfu_k7,addr)
#define RFU_S6_REG_DECLARE(addr) REG_DECL(ns_reg_rfu_s6,addr)
#define RFU_S6_REG(addr) REG(ns_reg_rfu_s6,addr)
#define RFU_S6_REG_DATA(addr) REG_DATA(ns_reg_rfu_s6,addr)
#define RFU_S6_REG_CLER(addr) REG_CLER(ns_reg_rfu_s6,addr)
#define RFU_S6_OP(addr) S6_OP(ns_reg_rfu_s6,addr)
#define RFU_S6_W(addr) S6_W(ns_reg_rfu_s6,addr)
#define RFU_S6_R(addr) S6_R(ns_reg_rfu_s6,addr)
#define CXU_S6_REG_DECLARE(addr) REG_DECL(ns_reg_cxu_s6,addr)
#define CXU_S6_REG(addr) REG(ns_reg_cxu_s6,addr)
#define CXU_S6_REG_DATA(addr) REG_DATA(ns_reg_cxu_s6,addr)
#define CXU_S6_REG_CLER(addr) REG_CLER(ns_reg_cxu_s6,addr)
#define CXU_S6_OP(addr) S6_OP(ns_reg_cxu_s6,addr)
#define CXU_S6_W(addr) S6_W(ns_reg_cxu_s6,addr)
#define CXU_S6_R(addr) S6_R(ns_reg_cxu_s6,addr)

#define RFU_K7_REG_DECLARE_2(addr0,addr1) REG_DECL_2(ns_reg_rfu_k7,addr0,addr1)
#define RFU_K7_REG_2(addr0,addr1) REG_2(ns_reg_rfu_k7,addr0,addr1)
#define RFU_K7_REG_DATA_2(addr0,addr1) REG_DATA_2(ns_reg_rfu_k7,addr0,addr1)
#define RFU_K7_REG_CLEAR_2(addr0,addr1) REG_CLEAR_2(ns_reg_rfu_k7,addr0,addr1)
#define RFU_K7OP_2(addr0,addr1,bit) K7OP_2(ns_reg_rfu_k7,addr0,addr1,bit)
#define RFU_K7_OP_2(addr0,addr1) K7_OP_2(ns_reg_rfu_k7,addr0,addr1)
#define RFU_K7_OP_DELAY_2(addr0,addr1,time) K7_OP_DELAY_2(ns_reg_rfu_k7,addr0,addr1,time)
#define RFU_K7_WAIT_IDLE_2(addr0,addr1,flag,times) K7_WAIT_IDLE_2(ns_reg_rfu_k7,addr0,addr1,flag,times)
#define RFU_K7_W_2(addr0,addr1) K7_W_2(ns_reg_rfu_k7,addr0,addr1)
#define RFU_K7_R_2(addr0,addr1) K7_R_2(ns_reg_rfu_k7,addr0,addr1)
#define RFU_S6_REG_DECLARE_2(addr0,addr1) REG_DECL_2(ns_reg_rfu_s6,addr0,addr1)
#define RFU_S6_REG_2(addr0,addr1) REG_2(ns_reg_rfu_s6,addr0,addr1)
#define RFU_S6_REG_DATA_2(addr0,addr1) REG_DATA_2(ns_reg_rfu_s6,addr0,addr1)
#define RFU_S6_WAIT_FIFO_EMPTY_2(addr0,addr1,flag,times) S6_WAIT_FIFO_EMPTY_2(ns_reg_rfu_s6,addr0,addr1,flag,times)
#define RFU_S6_W_2(addr0,addr1) S6_W_2(ns_reg_rfu_s6,addr0,addr1)
#define RFU_S6_R_2(addr0,addr1) S6_R_2(ns_reg_rfu_s6,addr0,addr1)

// Register Define

namespace ns_reg_rfu_k7 {

REG_DEF_CPT_PREFIX_32(0x0000)
    unsigned op : 1;  // DMA state-machine reset signal
    unsigned rsv : 7;
    unsigned ver : 8; // firmware version
    unsigned cdw : 4;
#define cdw_invalid 0
#define cdw_32      1
#define cdw_64      2
#define cdw_128     3
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0001)
    unsigned fpga_wr_op : 1;   // FPGA DMA write start signal
    unsigned rsv : 6;
    unsigned dis_wr_int : 1;   // Disable FPGA DMA write interruption
    unsigned fpga_wr_done : 1; // FPGA DMA write done
    unsigned rsv2 : 7;

    unsigned fpga_rd_op : 1;   // FPGA DMA read start signal
    unsigned rsv3 : 6;
    unsigned dis_rd_int : 1;   // Disable FPGA DMA read interruption
    unsigned fpga_rd_done : 1; // FPGA DMA read done
    unsigned rsv4 : 7;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0002)
    unsigned op : 1;    // FPGA reset signal
    unsigned rsv0 : 3;
    unsigned ld_da : 1; // ADF4351(to DAC) lock detect
    unsigned rsv1 : 3;
    unsigned ld_ad : 1; // ADF4351(to ADC) lock detect
    unsigned rsv : 23;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0007)
    unsigned adr : 32; // FPGA DMA read physical address
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0008)
    unsigned tlp_size : 16; // FPGA DMA read TLP size
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0009)
    unsigned tlp_count : 20; // FPGA DMA read TLP count
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0014)
    unsigned samples : 32; // FPGA DMA write total samples written
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0016)
    unsigned data : 32; // FPGA DMA write physical memory block index
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0017)
    unsigned adr : 32; // FPGA DMA write physical memory block address
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0020)
    unsigned dma_rd_timer : 32; // FPGA DMA read timer
REG_DEF_CPT_SUFFIX_32

