Andydingbing/SPC5/rd/chip/reg_def_sp9500.h
REG_DEF_CPT_PREFIX_32(0x0549)
    unsigned en : 1; // arb en
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x054a)
    /*
     * hyper_frame_trig_in_offset :
     * hyper frame trigger in offset value,default 0
     * range : 0 - \see 0x0547.hyper_frame_period
     */
    unsigned hyper_frame_trig_in_offset : 32;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x054c)
    /*
     * frame_trig_out_offset :
     * frame trigger out offset value,default 0
     * algorithm : \see 0x0548
     */
    unsigned frame_trig_out_offset : 24;
    unsigned rsv0 : 8;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x054e)
    /*
     * hyper_frame_trig_out_offset :
     * hyper frame trigger out offset value,default 0
     * range : \see 0x054a
     */
    unsigned hyper_frame_trig_out_offset : 32;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0550)
    /*
     * slot_time :
     * slot time(default 0.5ms(24'h1E000)) in a radio frame(default 10ms)
     * algorithm : slot_time = time * 245.76e6
     */
    unsigned slot_time : 24;
    unsigned rsv0 : 8;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0551)
    /*
     * DL/UL trigger radio frame(default range : 0 --- 1023)
     */
    unsigned frame : 12;
    unsigned rsv : 20;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0552)
    /*
     * DL/UL trigger slot in a radio frame(default range : 0 --- 19)
     */
    unsigned slot : 8;
    unsigned rsv : 24;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0553)
    /*
     * trig_src : IQ capture trigger source.
     *    [1:0] : 00 : Next 10ms.
     *            01 : Specified radio frame.
     *            10 : mod(frame(x)) = y.
     */
    unsigned trig_src : 2;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0554)
    /*
     * frame :
     * current radio frame counter,read only
     */
    unsigned frame : 32;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0555)
    /*
     * slot :
     * current slot in a radio frame counter,read only
     */
    unsigned slot : 8;
    unsigned rsv : 24;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x0556)
    unsigned y : 16;
    unsigned x : 16;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32_2(0x1062,0x1092)
    unsigned iqcap_src_sel :6;  // rx power meas source
    unsigned iqcap_src_edge :1; // rx power meas edge
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x1063,0x1093)
    unsigned iqcap_timeout : 31; // rx power meas timeout time(1/62.5e6 s)
    unsigned iqcap_tmo : 1;      // rx power meas timeout result(1:timeout)
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x1064,0x1094)
    unsigned op : 1; // rx power meas en
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x1065,0x1095)
    unsigned abort : 1; // rx power meas abort
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x1066,0x1096)
    unsigned samples : 32; // rx power meas samples
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x1067,0x1097)
    unsigned gap : 32; // rx power meas gap
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x1068,0x1098)
    unsigned threshold : 32; // rx power meas threshold
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x1069,0x1099)
    unsigned rsv : 23;
    unsigned op : 1; // rx 2i3d fir filter en //reserved
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x106c,0x109c) // rx 2i3d fir filter paramter //reserved
    unsigned real : 16;
    unsigned addr : 8;
    unsigned rev : 4;
    unsigned group : 3;
    unsigned op : 1;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x1074,0x10a4) // rx power meas state machine
    unsigned state : 5;    // dle;waiting for trigger;trigger timeout;running;done
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x1075,0x10a5)
    unsigned iq_sum : 32; // rx power meas power peak
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x1076,0x10a6)
    unsigned iq_sum_h : 32; // rx power meas power iq 32H
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x1077,0x10a7)
    unsigned iq_sum_l : 32; // rx power meas power iq 32L
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x1080,0x10b0)
    unsigned imag : 16; // rx 2i3d fir filter coef imag //reserved
    unsigned rsv0 : 16;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x10c0,0x10f0)
    unsigned iqcap_trig_offset :32; // no list iq cap trigger offset
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x10c1,0x10f1)
    unsigned iqcap_cap_offset : 32; // no list iq cap cap offset
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x10c2,0x10f2)
    unsigned iqcap_src_sel :6;
    unsigned iqcap_src_edge :1;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x10c3,0x10f3)
    unsigned iqcap_timeout : 31;
    unsigned iqcap_tmo : 1;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32(0x10c4)
    unsigned op : 1; // q cap start
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x10c5)
    unsigned abort : 1; // iq cap abort
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x10c6)
    unsigned samples : 32; // iq cap total samples(ch0 + ch1)
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32_2(0x10c7,0x10f7)
    unsigned gap : 32; // iq cap trigger gap
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x10c8,0x10f8)
    unsigned threshold : 32;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32(0x10c9)
     unsigned data : 32;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x10ca)
     unsigned trigg_offset : 32;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x10cb)
     unsigned data : 32;
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32(0x10cf)
    unsigned cap_tlp_count : 16; // iq cap tlp count
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32_2(0x1601,0x1681)
    unsigned op : 1; // r1a/b rx lo1 spi write en
    unsigned busy : 1;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x1602,0x1682)
    unsigned data : 32; // r1a/b rx lo1 spi data
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x1603,0x1683)
    unsigned muxout : 1; // r1a/b rx lo1 muxout
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x1605,0x1685)
    unsigned op : 1; // r1a/b rx lo2 spi write en
    unsigned busy : 1;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x1606,0x1686)
    unsigned data : 32; // r1a/b rx lo2 spi data
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x1607,0x1687)
    unsigned muxout : 1; // r1a/b rx lo2 muxout
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x1609,0x1689)
    unsigned op : 1; // r1a/b tx lo1 spi write en
    unsigned busy : 1;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x160a,0x168a)
    unsigned data : 32; // r1a/b tx lo1 spi data
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x160b,0x168b)
    unsigned muxout : 1; // r1a/b tx lo1 muxout
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x160d,0x168d)
    unsigned op : 1; // r1a/b tx lo2 spi write en
    unsigned busy : 1;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x160e,0x168e)
    unsigned data : 32; // r1a/b tx lo2 spi data
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x160f,0x168f)
    unsigned muxout : 1; // r1a/b tx lo2 muxout
REG_DEF_CPT_SUFFIX_32_2

