Andydingbing/SPC5/rd/chip/reg_def_sp9500.h
REG_DEF_CPT_PREFIX_32_2(0x1611,0x1691)
    unsigned op : 1;   // r1a/b ad7680 en
    unsigned busy : 1; // r1a/b ad7680 bus state
    unsigned rsv : 14;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x1612,0x1692)
    unsigned adc : 32; // r1a/b ad7680 value
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x1615,0x1695)
    unsigned tmp : 32; // r1a/b rx temp
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x1618,0x1698)
    unsigned tmp : 32; // r1a/b tx temp
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x161d,0x169d)
    unsigned op : 1;   // r1a/b/c/d at24c256b(eeprom) spi write en
    unsigned mode : 1; // 0:write 1:read
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x161e,0x169e)
    unsigned addr : 16; // r1a/b/c/d eeprom address
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x161f,0x169f)
    unsigned wr_data : 8; // r1a/b/c/d eeprom write mode write data
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x1620,0x16a0)
    unsigned rd_data : 8; // r1a/b/c/d eeprom read mode read data
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x163d,0x16bd)
    unsigned op : 1;   // r1a/b ltc2666 spi write en
    unsigned busy : 1; // r1a/b ltc2666 spi bus state
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x163f,0x16bf) // r1a/b ltc2666 spi write data
    unsigned data_word    : 16;
    unsigned address_word : 4;
    unsigned command_word : 4;
    unsigned dont_care    : 8;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x1640,0x16c0) // r1a/b ltc2666 spi read data
    unsigned data_word    : 16;
    unsigned address_word : 4;
    unsigned command_word : 4;
    unsigned dont_care    : 8;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x1641,0x16c1)
    unsigned op : 1;   // r1a/b rx att1 spi write en
    unsigned busy : 1; // r1a/b rx att1 spi bus state
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x1642,0x16c2)
    unsigned data_word : 6; // r1a/b rx att1 spi write data
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x1660,0x16e0)
    unsigned pow_en : 1; // r1a/b tx power sw(0:off 1:on)
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x1661,0x16e1)
    unsigned det_sw : 1; // r1a/b ad7680 sw(0:tx 1:rx)
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x1662,0x16e2)
    unsigned mod_en : 1; // r1a/b tx adl5375 mod en
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x1663,0x16e3)
    unsigned band_sw : 1; // r1a/b tx band sw
    unsigned q : 1;       // r1a/b q reverse
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x1664,0x16e4) // r1a/b tx att1/2/3
    unsigned tx_att3_c1 : 1;
    unsigned tx_att3_c2 : 1;
    unsigned tx_att1_c1 : 1;
    unsigned tx_att1_c2 : 1;
    unsigned tx_att2_c2 : 1;
    unsigned tx_att2_c1 : 1;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x1665,0x16e5)
    unsigned att_pa_sw : 1; // r1a/b tx pa/att sw
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x1666,0x16e6) // r1a/b io sw
    unsigned rx_io_sw1	 : 1;
    unsigned rx_io_sw2	 : 1;
    unsigned rx_io_sw	 : 2;
    unsigned tx_io_sw	 : 2;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x1667,0x16e7) // r1a/b io led sw(0:off 1:on)
    unsigned tx_led : 1;
    unsigned rx_led : 1;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x1668,0x16e8)
    unsigned fil_sw : 1; // r1a/b/c/d rx if filter sw(0:100MHz 1:160MHz)
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x1669,0x16e9) // r1a/b rx att2
    unsigned rx_att2_c1 : 1;
    unsigned rx_att2_c2 : 1;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x166a,0x16ea)
    unsigned lna_att_sw : 1; // r1a/b rx lna/att sw(0:att 1:lna)
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32(0x1670)
    unsigned data : 32; // reserved
REG_DEF_CPT_SUFFIX_32

REG_DEF_CPT_PREFIX_32_2(0x1804,0x2804) // r1c/d hmc1197 spi open mode
    unsigned op   : 1;
    unsigned wr   : 1;
    unsigned busy : 1;
    unsigned rsv  : 1;
    unsigned mod  : 1;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x1805,0x2805)
    unsigned data : 32; // r1c/d hmc1197 spi open mode write data
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x1807,0x2807)
    unsigned data : 32; // r1c/d hmc1197 spi open mode read data
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x1810,0x2810)
    unsigned op : 1;   // r1c/d tx att0 spi write en
    unsigned busy : 1; // r1c/d tx att0 spi bus state
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x1811,0x2811)
    unsigned data_word : 8; // r1c/d tx att0 spi write data
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x1814,0x2814)
    unsigned op : 1;   // r1c/d tx att1 spi write en
    unsigned busy : 1; // r1c/d tx att1 spi bus state
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x1815,0x2815)
    unsigned data_word : 8; // r1c/d tx att1 spi write data
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x1818,0x2818)
    unsigned op : 1;   // r1c/d tx att2 spi write en
    unsigned busy : 1; // r1c/d tx att2 spi bus state
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x1819,0x2819)
    unsigned data_word : 8; // r1c/d tx att2 spi write data
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x181c,0x281c)
    unsigned op : 1;   // r1c/d tx att3 spi write en
    unsigned busy : 1; // r1c/d tx att3 spi bus state
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x181d,0x281d)
    unsigned data_word : 8; // r1c/d tx att3 spi write data
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x1820,0x2820)
    unsigned op : 1;   // r1c/d rx att1 spi write en
    unsigned busy : 1; // r1c/d rx att1 spi bus state
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x1821,0x2821)
    unsigned data_word : 8; // r1c/d rx att1 spi write data
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x1824,0x2824)
    unsigned op : 1;   // r1c/d rx att2 spi write en
    unsigned busy : 1; // r1c/d rx att2 spi bus state
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x1825,0x2825)
    unsigned data_word : 8; // r1c/d rx att2 spi write data
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x1827,0x2827)
    unsigned sw : 1; // r1c/d rx power det if1/if2 sw
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x1828,0x2828)
    unsigned filter : 1; // r1c/d tx filter sw
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x1829,0x2829)
    unsigned pow_en : 1; // r1c/d tx power sw(0:off 1:on)
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x182b,0x282b)
    unsigned op : 1;   // r1c/d rx att3 spi write en
    unsigned busy : 1; // r1c/d rx att3 spi bus state
    unsigned rsv0 : 30;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x182c,0x282c)
    unsigned data_word : 6; // r1c/d rx att3 spi write data
    unsigned rsv0 : 26;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x182d,0x282d)
    unsigned addr : 8;
    unsigned wr : 1;
    unsigned op : 1;
    unsigned busy : 1;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x182e,0x282e)
    unsigned data : 8; // r1c/d io ext spi write data
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x182f,0x282f)
    unsigned data : 8;
    unsigned rsv0 : 24;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x1832,0x2832) // r1c/d 3208
    unsigned addr : 3;
    unsigned op : 1;
    unsigned rsv : 4;
    unsigned busy : 1;
    unsigned rsv0 : 23;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x1833,0x2833)
    unsigned ad : 12; // r1c/d 3208 spi read data
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x1835,0x2835)
    unsigned filter : 1; // r1d tx lo2 filter sw
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x1836,0x2836) // r1c/d hmc1197 spi hmc mode
    unsigned addr : 8;
    unsigned wr : 1;
    unsigned op : 1;
    unsigned busy : 1;
REG_DEF_CPT_SUFFIX_32_2

REG_DEF_CPT_PREFIX_32_2(0x1837,0x2837)
    unsigned data : 24; // r1c/d hmc1197 spi hmc mode write data
REG_DEF_CPT_SUFFIX_32_2

